In [11]:
import pandas as pd
import numpy as np

obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj
obj['b']
obj[1]
obj[2:4]
obj['a':'c']
obj[[1,2,3]]
obj[['a','b','c']]
obj[ obj > 2]
obj['a':'c'] = 5
obj

a    5.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [29]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
                  columns=['one', 'two', 'three', 'four'])
df
df['two']
df[['two','three']]
df[:2]
df[ df['three'] > 5]
df < 5

df[ df < 5 ] = 0

In [45]:
df.loc['Colorado',['one','two']]

df.iloc[2,[0,1,2]]
df.iloc[1]
df.iloc[[1,2],[1,0,2]]
df.loc[:'Utah', 'two']
df
df.iloc[:, :3][df.three > 5]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>one</th>
      <th>two</th>
      <th>three</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Ohio</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>Colorado</th>
      <td>0</td>
      <td>5</td>
      <td>6</td>
    </tr>
    <tr>
      <th>Utah</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
    </tr>
    <tr>
      <th>New York</th>
      <td>12</td>
      <td>13</td>
      <td>14</td>
    </tr>
  </tbody>
</table>
</div>